Revit 2027 API
Ceiling.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of ceiling within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double) |  Creates a new instance of ceiling within the project.
Top
See Also
Reference
Ceiling Class
Autodesk.Revit.DB Namespace